app/views/challenges/_form.html.erb

	Challenge User:
	<%= f.collection_select :user_to_id, User.all, :id, :username %>
---
SELECT "users".* FROM "users"