app/views/challenges/my_challenges.html.erb

SELECT "challenges".* FROM "challenges" WHERE "challenges"."user_to_id" = 3 ORDER BY created_at DESC
---
<% title "My Challenges" %>
<%  @challenges = Challenge.find_all_by_user_to_id(current_user.id, :order => 'created_at DESC') %>

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
			<% if User.exists?(challenge.user_from_id)
			 user_from = User.find(challenge.user_from_id)%>