app/views/challenges/sent_challenges.html.erb

<% title "Sent Challenges" %>
<%  @challenges = Challenge.find_all_by_user_from_id(current_user.id, :order => 'created_at DESC') %>
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."user_from_id" = 3 ORDER BY created_at DESC

  		<td>
				<% user_from = User.find(challenge.user_from_id)%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1