app/views/challenges/show.html.erb

  <strong>From:</strong>
  <% user_from = User.find(@challenge.user_from_id)%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1