app/controllers/challenges_controller.rb

  def index
    if current_user.nil?
      redirect_to :controller=>'user_sessions', :action => 'new';
    end
    @challenges = [];#Challenge.find_all_by_user_from_id(current_user.id)
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."user_from_id" = 3 LIMIT 1

  def show
    @challenge = Challenge.find(params[:id])
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 1 LIMIT 1

  def create
    @challenge = Challenge.new(params[:challenge])
    @challenge[:user_from_id] = current_user.id
    @challenge[:complete_dt] = nil;
    @challenge[:accepted_dt] = nil;
    if @challenge.save
---
INSERT INTO "challenges" ("user_from_id", "user_to_id", "challenge_txt", "challenge_tm", "send_dt", "accepted", "accepted_dt", "due_dt", "complete_dt", "created_at", "updated_at") VALUES (0, 0, ' gyfcdhwxqi', 0, '2011-06-11', 0, '2011-06-11', '2011-06-11', '2011-06-11', '2011-06-11 22:42:05.007221', '2011-06-11 22:42:05.007221')

  def edit
    @challenge = Challenge.find(params[:id])
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 1 LIMIT 1

  def update
    @challenge = Challenge.find(params[:id])

    if @challenge.update_attributes(params[:challenge])
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 1 LIMIT 1
UPDATE "challenges" SET "updated_at" = '2011-06-12 18:29:33.777247', "accepted_dt" = '2011-06-12', "accepted" = 1 WHERE "challenges"."id" = 46

  def destroy
    @challenge = Challenge.find(params[:id])
    @challenge.destroy
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 4 LIMIT 1
DELETE FROM "challenges" WHERE "challenges"."id" = 4