app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "crypted_password", "password_salt", "persistence_token", "created_at", "updated_at") VALUES ('etrvfbdnqs', 'test1@rLabG.com', '2c3f844fdee281d7535ba417ca81ae0628f0e4b9bad57fe3c81b6421d9b86ecaf35f52cd15e664b2a21fc3fe4a87a062f4daf4db688fb70c99b74520d0890396', 'Jh5k4oa7O3UIqvimrFt', 'a9da6428bb7aadbd5bca42ce298dcabf430e7113e3279b985a335cb8f7da6edcf545655a808fed6aeee3745776e7f95761089b58d396d881ff1af1afee989cac', '2011-06-11 23:27:31.625259', '2011-06-11 23:27:31.625259')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save